//------------------------------------------------------------------------------
// Модуль реализует Check Box
//------------------------------------------------------------------------------
#ifndef CHECK_BOX_h
#define CHECK_BOX_h

void DrawCheckBox(char x, char y, char checked, char selected);
//------------------------------------------------------------------------------
// Init и Process
//------------------------------------------------------------------------------
//void InitCursor(void);
//void ProcessCursor(void);

#endif
