//------------------------------------------------------------------------------
// Модуль реализует автомат управления курсором
//------------------------------------------------------------------------------
#ifndef CURSOR_h
#define CURSOR_h

#define cur_period 100  //период мигания курсора 1с = 100 * 10 мс

//------------------------------------------------------------------------------
// Функция SetCursorPos
// Функция устанавливает позицию курсора
// Параметры
// x, y - координаты курсора
//------------------------------------------------------------------------------
void SetCursorPos(char x, char y);

//------------------------------------------------------------------------------
// Init и Process
//------------------------------------------------------------------------------
void InitCursor(void);
void ProcessCursor(void);

#endif
