//------------------------------------------------------------------------------
// Модуль реализует функции работы с дисплеем
//------------------------------------------------------------------------------
#ifndef LCD_h
#define LCD_h

#define SMALL_FONT 0
#define BIG_FONT 1

#define BLACK 0
#define WHITE ~BLACK

#define NON_INVERT_MODE 0
#define INVERT_MODE ~NON_INVERT_MODE

void LcdSetColor(char color);

void LcdSetFont(char font);

void LcdSetInvertMode(char invert_mode);

//------------------------------------------------------------------------------
// Ф-ция очищает экран
//------------------------------------------------------------------------------
void LcdClear(void);

//------------------------------------------------------------------------------
// Ф-ция передает в LCD содержимое видеобуфера
//------------------------------------------------------------------------------
void LcdDraw(void);

//------------------------------------------------------------------------------
void LcdLine(char x1, char y1, char x2, char y2);

//------------------------------------------------------------------------------
void LcdText(char x1, char y1, char x2, char y2, char *text);

//------------------------------------------------------------------------------
void LcdRect(char x1, char y1, char x2, char y2);

//------------------------------------------------------------------------------
void LcdFrame(char x1, char y1, char x2, char y2);

//------------------------------------------------------------------------------
// Ф-ция выводит на экран изображение
// Параметры:
// x1, y1 - координаты
// w, h - ширина и высота
// *address - адрес массива с изображением
//------------------------------------------------------------------------------
void LcdBmp(char x1, char y1, char w, char h, char *address);

/*
//------------------------------------------------------------------------------
// Ф-ция рисует горизонтальную линию черного цвета
// Параметры:
// x1, y1, x2 - координаты
//------------------------------------------------------------------------------
void LCD_horline(char x1, char y1, char x2);

//------------------------------------------------------------------------------
// Ф-ция рисует горизонтальную линию белого цвета
// Параметры:
// x1, y1, x2 - координаты
//------------------------------------------------------------------------------
void LCD_horlineinv(char x1, char y1, char x2);

//------------------------------------------------------------------------------
// Ф-ция рисует вертикальную линию черного цвета
// Параметры:
// x1, y1, у2 - координаты
//------------------------------------------------------------------------------
void LCD_vertline(char x1, char y1, char y2);

//------------------------------------------------------------------------------
// Ф-ция рисует вертикальную линию белого цвета
// Параметры:
// x1, y1, у2 - координаты
//------------------------------------------------------------------------------
void LCD_vertlineinv(char x1, char y1, char y2);

//------------------------------------------------------------------------------
// Ф-ция рисует прямоугольник черного цвета
// Параметры:
// x1, y1, х2, у2 - координаты
//------------------------------------------------------------------------------
void LCD_rect(char x1, char y1, char x2, char y2);

//------------------------------------------------------------------------------
// Ф-ция рисует прямоугольник белого цвета
// Параметры:
// x1, y1, х2, у2 - координаты
//------------------------------------------------------------------------------
void LCD_rectinv(char x1, char y1, char x2, char y2);

//------------------------------------------------------------------------------
// Ф-ция выводит на экран текст черного цвета
// Параметры:
// x1, y1 - координаты
// str - текст
//------------------------------------------------------------------------------
void LCD_textout(char x1, char y1, char *str);

//------------------------------------------------------------------------------
// Ф-ция выводит на экран текст белого цвета
// Параметры:
// x1, y1 - координаты
// str - текст
//------------------------------------------------------------------------------
void LCD_textoutinv(char x1, char y1, char *str);
*/
#endif
