//------------------------------------------------------------------------------
// Модуль реализует функции работы с дисплеем
//------------------------------------------------------------------------------
#include "board.h"
#include "lcd_low_level.h"

//------------------------------------------------------------------------------
// Ф-ция предназначена для записи байта в LCD
// Параметры:
//   chip - номер контроллера
//   LCD_A0 - состояние линии A0
//   byte - передаваемый байт
//------------------------------------------------------------------------------
void LcdWriteByte(char chip, char a0, char byte)
{
  if (a0)
    LcdA0Set();
  else
    LcdA0Clr();
  if (chip == 0)
  {
    LcdE1Set();
    LcdE2Clr();
  }
  else
  {
    LcdE1Clr();
    LcdE2Set();
  };
  Delay(500);
  LcdESet();
  
  LcdData(byte);
  Delay(500);
  LcdEClr();
  Delay(500);
}

//------------------------------------------------------------------------------
// Ф-ция предназначена для установки текущей страницы LCD
// Параметры:
//   chip - номер контроллера
//   page - страница
//------------------------------------------------------------------------------
void LcdSetPage(char chip, char page)
{
  LcdWriteByte(chip, 0, 0xB8 | page);
}

//------------------------------------------------------------------------------
// Ф-ция предназначена для установки текущего адреса в странице
// Параметры:
//   chip - номер контроллера
//   addr - адрес
//------------------------------------------------------------------------------
void LcdSetAddress(char chip, char addr)
{
  LcdWriteByte(chip, 0, 0x40 | addr);
}

//------------------------------------------------------------------------------
// Инициализация LCD при включении питания
//------------------------------------------------------------------------------
void LcdInitModule(void)
{
//  PIOcfgout( LCD_CONTROLS );
//  PIOcfgout(LCD_DATA);
  LcdResClr();
  Delay(500);
  LcdResSet();
  Delay(500);
  LcdEClr();
  
  LcdWriteByte(0, 0, 0x3F);  //turn on
  LcdWriteByte(0, 0, 0xC0);  //set start line 0
  LcdWriteByte(0, 0, 0xB8);  //set page 0
  LcdWriteByte(0, 0, 0x40);  //set address 0

  LcdWriteByte(1, 0, 0x3F);  //turn on
  LcdWriteByte(1, 0, 0xC0);  //set start line 0
  LcdWriteByte(1, 0, 0xB8);  //set page 0
  LcdWriteByte(1, 0, 0x40);  //set address 0
}
