//------------------------------------------------------------------------------
// Модуль реализует низкоуровневые функции работы с дисплеем
//------------------------------------------------------------------------------
#ifndef LCD_LOW_h
#define LCD_LOW_h

void LcdWriteByte(char chip, char a0, char byte);

void LcdSetPage(char chip, char page);

void LcdSetAddress(char chip, char addr);
//------------------------------------------------------------------------------
// Инициализация LCD при включении питания
//------------------------------------------------------------------------------
void LcdInitModule(void);

#endif
