//------------------------------------------------------------------------------
// Модуль реализует экран меню
//------------------------------------------------------------------------------
#ifndef MENU_SCREEN_h
#define MENU_SCREEN_h
/*
typedef struct{
  char header[25]; //заголовок экрана
  int var1; //тэг переменной 1
  int var2; //тэг переменной 2
  int var3; //тэг переменной 3
  int var4; //тэг переменной 4
  int number; //номер экрана
  char back_allowed; //кнопка "назад" разрешена
  char home_allowed; //кнопка "главный экран" разрешена
  char forward_allowed; //кнопка "вперед" разрешена
} T_SCREEN_DESCRIPTOR;
*/
typedef struct{
  char header[25]; //заголовок экрана
  char buttons[8][13]; //надписи на кнопках меню
  char btn_allowed[8]; //кнопка разрешена
  int number; //номер экрана
  char back_allowed; //кнопка "назад" разрешена
  char home_allowed; //кнопка "главный экран" разрешена
  char forward_allowed; //кнопка "вперед" разрешена
} T_MENU_DESCRIPTOR;
/*
#define SCREEN_O2 0 //- настройки канала кислорода
#define SCREEN_XH 1 //- настройки канала химнедожога
#define SCREEN_T  2 //- настройки канала температуры
#define SCREEN_X  3 //- зарезервировано

//------------------------------------------------------------------------------
// Функция SetParamScreen
// Функция устанавливает параметры экрана
// Функция должна быть вызвана перед активацией экрана
// Параметры:
//   ch - канал (0 - левый, 1 - правый)
//   screen - экран
//     SCREEN_O2 - настройки канала кислорода
//     SCREEN_XH - настройки канала химнедожога
//     SCREEN_T - настройки канала температуры
//     SCREEN_X - зарезервировано
//------------------------------------------------------------------------------
void SetParamScreen(char ch, char screen);

//------------------------------------------------------------------------------
// Init и Process
//------------------------------------------------------------------------------
void InitParamScreen(void);
void ProcessParamScreen(void);
*/

void DrawMenuScreen(void);

#endif
