//------------------------------------------------------------------------------
// Модуль реализует обработку результатов измерений
//------------------------------------------------------------------------------
#ifndef PROCESSING_h
#define PROCESSING_h

//void DrawMainScreen(void);
//------------------------------------------------------------------------------
// Init и Process
//------------------------------------------------------------------------------
//void InitCursor(void);
//void ProcessCursor(void);

#endif